# IFCFatalExportError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ExportFailures..::..IFCFatalExportError Property
BuiltInFailures..::..ExportFailures Class See Also
---
There has been an unrecoverable error during export. Export will now be aborted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId IFCFatalExportError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property IFCFatalExportError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ IFCFatalExportError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ExportFailures Class
Autodesk.Revit.DB Namespace